# Script dependencies
brew 'coreutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
# rsync 3.x rather than the old 2.x
brew 'rsync'
brew 'jq'
brew 'parallel'
brew 'patchutils'
brew 'pv'
# needed for node
brew 'gnupg'
brew 'neovim'

# For youtube-dl
brew 'ffmpeg'
brew 'rtmpdump'

# Extras
brew 'dfc'
brew 'htop-osx'
