# Script dependencies
brew 'coreutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
# rsync 3.x rather than the old 2.x
brew 'rsync'
brew 'jq'
brew 'parallel'
brew 'patchutils'
brew 'pup'
brew 'pv'
brew 'terminal-notifier'

# For youtube-dl
brew 'ffmpeg'
brew 'rtmpdump'

# Extras
brew 'dfc'
brew 'htop-osx'
brew 'cabal-install'
brew 'go'
brew 'node'
brew 'shellcheck'
brew 'sshuttle'
